#include "reg52.h"			 //´ËÎÄ¼þÖÐ¶¨ÒåÁËµ¥Æ¬»úµÄÒ»Ð©ÌØÊâ¹¦ÄÜ¼Ä´æÆ÷

typedef unsigned int u16;	  //¶ÔÊý¾ÝÀàÐÍ½øÐÐÉùÃ÷¶¨Òå
typedef unsigned char u8;

sbit LSA=P2^2;
sbit LSB=P2^3;
sbit LSC=P2^4;

u8 code smgduan[17]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,
					0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};//ÏÔÊ¾0~FµÄÖµ
u16 s;
u8 sec,mb[2];


void Timer0Init()
{
	TMOD|=0X01;//Ñ¡ÔñÎª¶¨Ê±Æ÷0Ä£Ê½£¬¹¤×÷·½Ê½1£¬½öÓÃTR0´ò¿ªÆô¶¯¡£
	TH0=0XFC;	//¸ø¶¨Ê±Æ÷¸³³õÖµ£¬¶¨Ê±1ms
	TL0=0X18;	
	TR0=1;//´ò¿ª¶¨Ê±Æ÷			
}

/*******************************************************************************
* º¯ Êý Ãû         : delay
* º¯Êý¹¦ÄÜ		   : ÑÓÊ±º¯Êý£¬i=1Ê±£¬´óÔ¼ÑÓÊ±10us
*******************************************************************************/
void delay(u16 i)
{
	while(i--);	
}


/*******************************************************************************
* º¯ Êý Ãû         : DigDisplay
* º¯Êý¹¦ÄÜ		   : ÊýÂë¹Ü¶¯Ì¬É¨Ãèº¯Êý£¬Ñ­»·É¨Ãè2¸öÊýÂë¹ÜÏÔÊ¾
*******************************************************************************/
void DigDisplay()
{
	u8 i;
	for(i=0;i<2;i++)
	{
		switch(i)	 //Î»Ñ¡£¬Ñ¡ÔñµãÁÁµÄÊýÂë¹Ü£¬
		{
			case(0):
				LSA=0;LSB=0;LSC=0; break;//ÏÔÊ¾µÚ0Î»
			case(1):
				LSA=1;LSB=0;LSC=0; break;//ÏÔÊ¾µÚ1Î»	
		}
		P0=smgduan[mb[i]];//·¢ËÍ¶ÎÂë
		delay(1); //¼ä¸ôÒ»¶ÎÊ±¼äÉ¨Ãè	
		P0=0x00;//ÏûÒþ
	}
}


/*******************************************************************************
* º¯ Êý Ãû       : main
* º¯Êý¹¦ÄÜ		 : Ö÷º¯Êý
* Êä    Èë       : ÎÞ
* Êä    ³ö    	 : ÎÞ
*******************************************************************************/
void main()
{	
	Timer0Init();
	while(1)
	{
		if(TF0==1)
		{
			TF0=0;
			TH0=0XFC;	//¸ø¶¨Ê±Æ÷¸³³õÖµ£¬¶¨Ê±1ms
			TL0=0X18;
			s++;
		}
		if(s==1000)		 //µ½´ï1sÊ±¼ä
		{	
			s=0;
			sec++;
			if(sec==100)sec=0;	 //¼ÆÊ±µ½100ÃëºóÖØÐÂ¿ªÊ¼
		}
		mb[0]=sec%10;	   //Ãë±í¸öÎ»
	    mb[1]=sec/10;	   //Ãë±íÊ®Î»
		DigDisplay();
	}
}
